app/views/users/welcome.html.haml

                    %p.mb0 Friends
                    %h3.m0 {{requestControl.user.friends.length}}
                  .col-xs-4.text-right
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]